mcuxrandall/2.04-Integration/Individual_Test_Projects/frdmmcxn947_integration_testbench/board/pin_mux.h
/*! @name PORT0_26 (coord F10), P0_26/J2[10]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PWMB_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PWMB_PIN 26U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PWMB_PIN_MASK (1U << 26U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORT2_3 (coord J3), RGB_B2_PWM/P2_3/TP4/J12[7]/J3[5]/SJ4[3]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Motor_BIN1_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Motor_BIN1_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_Motor_BIN1_GPIO_PIN 3U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_Motor_BIN1_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Motor_BIN1_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Motor_BIN1_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Motor_BIN1_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT1_22 (coord L4), P1_22/J9[24]/J3[3]/SJ9[3]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Motor_BIN2_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Motor_BIN2_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITPINS_Motor_BIN2_GPIO_PIN 22U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_Motor_BIN2_GPIO_PIN_MASK (1U << 22U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Motor_BIN2_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Motor_BIN2_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Motor_BIN2_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT4_18 (coord N10), P4_18/J8[23]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Board_output_PORT PORT4                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Board_output_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Board_output_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT4_22 (coord T12), P4_22/J8[27]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Board_input_PORT PORT4                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Board_input_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Board_input_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT4_1 (coord P2), P4_1/J8[3]/SJ15[1]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_OLED_I2C_SCK_PORT PORT4               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_OLED_I2C_SCK_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_OLED_I2C_SCK_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT4_0 (coord P1), P4_0/J8[4]/SJ14[1]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_OLED_I2C_SDA_PORT PORT4               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_OLED_I2C_SDA_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_OLED_I2C_SDA_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#define PCR_IBE_ibe1 0x01u /*!<@brief Input Buffer Enable: Enables */

/*! @name PORT1_9 (coord B1), P1_9/J9[30]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_TX_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_TX_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_TX_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                                        /* @} */

/*! @name PORT1_8 (coord A1), P1_8/J9[32]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_RX_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_RX_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_RX_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void);

/*! @name PORT0_1 (coord A16), P0_1/SWCLK/J23[4]/D16[5]/J22[2]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITSWD_DEBUGPINS_DEBUG_SWD_SWDCLK_PORT PORT0               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSWD_DEBUGPINS_DEBUG_SWD_SWDCLK_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITSWD_DEBUGPINS_DEBUG_SWD_SWDCLK_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                                          /* @} */

/*! @name PORT0_0 (coord A17), P0_0/SWDIO/J23[2]/D16[6]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITSWD_DEBUGPINS_DEBUG_SWD_SWDIO_PORT PORT0               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSWD_DEBUGPINS_DEBUG_SWD_SWDIO_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITSWD_DEBUGPINS_DEBUG_SWD_SWDIO_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                                         /* @} */

/*! @name PORT0_2 (coord B16), P0_2/SWO/J23[6]/D16[4]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITSWD_DEBUGPINS_DEBUG_SWD_SWO_PORT PORT0               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSWD_DEBUGPINS_DEBUG_SWD_SWO_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITSWD_DEBUGPINS_DEBUG_SWD_SWO_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSWD_DEBUGPins(void);

